import pandas as pd
import numpy
import re

#制作词库 {}
text=[['半导体', '产业链', 2, 'CHAN01000'], ['原材料', 1, 'CHAN01001'], ['设备', 1, 'CHAN01002'], ['芯片', '设计', 2, 'CHAN01003'], ['制造', 1, 'CHAN01004'], ['封装', '测试', 2, 'CHAN01005'], ['产业', '配套', 2, 'CHAN01006'], ['晶圆', '衬底', 2, 'CHAN01007'], ['晶圆', '制造', '材料', 3, 'CHAN01008'], ['封装', '材料', 2, 'CHAN01009'], ['测试', '耗材', 2, 'CHAN01010'], ['包装材料', 1, 'CHAN01011'], ['其他', '半导体', '材料', 3, 'CHAN01012'], ['晶圆', '衬底', '设备', 3, 'CHAN01013'], ['掩', '模版', '设备', 3, 'CHAN01014'], ['晶圆', '制造', '设备', 3, 'CHAN01015'], ['封装', '测试', '设备', 3, 'CHAN01016'], ['晶圆', '操作', '、', '搬', '送', '、', '仓储', '设备', 8, 'CHAN01017'], ['其他', '半导体', '设备', 3, 'CHAN01018'], ['配件', 1, 'CHAN01019'], ['集成电路', '设计', 2, 'CHAN01020'], ['分立', '器件', '设计', 3, 'CHAN01021'], ['传感器', '设计', 2, 'CHAN01022'], ['光电', '器件', '设计', 3, 'CHAN01023'], ['硅', '材料', '半导体', '加工', 4, 'CHAN01024'], ['化合物', '半导体', '加工', 3, 'CHAN01025'], ['半导体', ' 封装', 2, 'CHAN01026'], ['半导体', '测试', 2, 'CHAN01027'], ['IDM', 1, 'CHAN01028'], ['工程技术', '服务', 2, 'CHAN01029'], ['半导体', '贸易', 2, 'CHAN01030'], ['软件系统', 1, 'CHAN01031'], ['硅晶圆', '衬底', 2, 'CHAN01033'], ['化合物', '衬底', 2, 'CHAN01034'], ['光刻胶', 1, 'CHAN01035'], ['光刻胶', '配套', '试剂', 3, 'CHAN01036'], ['气体', 1, 'CHAN01037'], ['掩', '模版', '相关', '材料', 4, 'CHAN01038'], ['化学', '机械抛光', '相关', '材料', 4, 'CHAN01039'], ['湿', '化学品', 2, 'CHAN01040'], ['靶材', 1, 'CHAN01041'], ['键合丝', '/', '引线', 3, 'CHAN01042'], ['引线', '劈刀', 2, 'CHAN01043'], ['框架', 1, 'CHAN01044'], ['焊料', 1, 'CHAN01045'], ['环氧树脂', 1, 'CHAN01046'], ['管壳', 1, 'CHAN01047'], ['封装', '基板', 2, 'CHAN01048'], ['贴片', '胶', 2, 'CHAN01049'], ['底', '填胶', 2, 'CHAN01050'], ['胶带', 1, 'CHAN01051'], ['聚酰亚胺', 1, 'CHAN01052'], ['其他', '封装', '材料', 3, 'CHAN01053'], ['测试', '载板', 2, 'CHAN01054'], ['测试', '插座', 2, 'CHAN01055'], ['探针', '卡', 2, 'CHAN01056'], ['其他', '测试', '耗材', 3, 'CHAN01057'], ['料管', 1, 'CHAN01058'], ['晶圆载', '具', 2, 'CHAN01059'], ['其他', '包装材料', 2, 'CHAN01060'], [' 长晶', '设备', 2, 'CHAN01061'], ['切片', '设备', 2, 'CHAN01062'], ['磨削', '设备', 2, 'CHAN01063'], ['抛光', '设备', 2, 'CHAN01064'], ['清洗', '设备', 2, 'CHAN01065'], ['晶圆', '衬底', '检测', '设备', 4, 'CHAN01066'], ['其他', '晶圆', '衬底', '设备', 4, 'CHAN01067'], ['镀膜', '设备', 2, 'CHAN01068'], ['光刻', '设备', 2, 'CHAN01069'], ['刻蚀', '设备', 2, 'CHAN01070'], ['掩', '模 版', '检测', '设备', 4, 'CHAN01071'], ['其他', '掩', '模版', '设备', 4, 'CHAN01072'], ['光刻', '曝光', '设备', 3, 'CHAN01073'], ['涂敷', '显影', '设备', 3, 'CHAN01074'], ['化学', '气相', '淀积', '设备', 4, 'CHAN01075'], ['物理', '气相', '淀积', '设备', 4, 'CHAN01076'], ['其它', '薄膜', '工艺设备', 3, 'CHAN01077'], ['干法', '工艺设备', 2, 'CHAN01078'], ['湿法', '工艺设备', 2, 'CHAN01079'], ['热处理', '设备', 2, 'CHAN01080'], ['离子注入', '设备', 2, 'CHAN01081'], ['晶圆', '制造', '检测', '测量', '设备', 5, 'CHAN01082'], ['其他', '晶圆', '制造', '设备', 4, 'CHAN01083'], ['切割', '开槽', '设备', 3, 'CHAN01084'], ['贴膜', '/', '撕膜', '设备', 4, 'CHAN01085'], ['扩膜', '分割', '设备', 3, 'CHAN01086'], ['挑晶', '设备', 2, 'CHAN01087'], ['固晶', '/', '贴片', '设备', 4, 'CHAN01088'], ['晶圆键合', '设备', 2, 'CHAN01089'], ['引线键合', '设备', 2, 'CHAN01090'], ['晶圆植球', '设备', 2, 'CHAN01091'], ['封装', '植球', '设备', 3, 'CHAN01092'], ['点胶', '设备', 2, 'CHAN01093'], ['塑封', '设备', 2, 'CHAN01094'], ['封装', '研磨', '设备', 3, 'CHAN01095'], ['切筋', '成型', '设备', 3, 'CHAN01096'], ['基板', '封装', '切割', '设备', 4, 'CHAN01097'], ['封装', '测试', '检测', '测量', '设备', 5, 'CHAN01098'], ['装带', '/', '料管', '设备', 4, 'CHAN01099'], ['测试', '设备', 2, 'CHAN01100'], ['Handler', 1, 'CHAN01101'], ['探针', '台', 2, 'CHAN01102'], ['其他', '封装', '测试', '设备', 4, 'CHAN01103'], [' 真空泵', 1, 'CHAN01104'], ['真空', '规', 2, 'CHAN01105'], ['静电', '吸盘', 2, 'CHAN01106'], ['质量', '流量', '控制器', 3, 'CHAN01107'], ['半导体', '设备', '电源', 3, 'CHAN01108'], ['射频', '微波', '源', 3, 'CHAN01109'], ['其他', '设备', '配件', 3, 'CHAN01110'], ['模拟', '/', '数模', '混合', '电路', 5, 'CHAN01111'], ['数字', '逻辑电路', 2, 'CHAN01112'], ['存储器', 1, 'CHAN01113'], ['功率', '器件', 2, 'CHAN01114'], ['小', '信号', '器件', 3, 'CHAN01115'], ['物理量', '传感器', 2, 'CHAN01116'], ['化学', '量', '传感器', 3, 'CHAN01117'], ['生物量', '传感器', 2, 'CHAN01118'], ['发光', '二极管', 2, 'CHAN01119'], ['半导体', '激光器', 2, 'CHAN01120'], ['光电', '耦合', '器', 3, 'CHAN01121'], ['受光', '器件', 2, 'CHAN01122'], ['先进', '制程', 2, 'CHAN01123'], ['成 熟', '制程', 2, 'CHAN01124'], ['MEMS', '制造', 2, 'CHAN01125'], ['光电子', '制造', 2, 'CHAN01126'], ['先进', '封装', 2, 'CHAN01127'], ['传统', '封装', 2, 'CHAN01128'], ['晶圆', '测试', 2, 'CHAN01129'], ['成品', '测试', 2, 'CHAN01130'], ['可靠性', '测试', '/', '老化', '测试', 5, 'CHAN01131'], ['代理', '分销', 2, 'CHAN01132'], ['二手', '贸易', 2, 'CHAN01133'], ['CIM', 1, 'CHAN01134'], ['AMHS', 1, 'CHAN01135'], ['ERP', 1, 'CHAN01136'], ['其他', '软件系统', 2, 'CHAN01137'], ['EDA', ' ', 2, 'CHAN01138'], ['IP', '核', 2, 'CHAN01139'], ['其他', '衬底', 2, 'CHAN01150'], ['数字', '逻辑', 'EDA', 3, 'CHAN01236'], ['模拟', '射频', 'EDA', 3, 'CHAN01237'], ['PCB', '/', 'Pachage', '/', 'System', 5, 'CHAN01238'], ['工艺', 'EDA', 2, 'CHAN01239'], ['其他', 'EDA', 2, 'CHAN01240'], ['处理器', 'IP', 2, 'CHAN01241'], ['基础', 'IP', 2, 'CHAN01242'], ['模拟', '和', '混合', '信号', 'IP', 5, 'CHAN01243'], ['接口', '和', '总线', '协议', 'IP', 5, 'CHAN01244'], ['存储', '与', '逻辑', '库', 'IP', 5, 'CHAN01245'], ['安全', '加密', 'IP', 3, 'CHAN01246'], ['射频', '和', '无线通信', 'IP', 4, 'CHAN01247'], ['图形处理', '和', '多媒体', 'IP', 4, 'CHAN01248'], ['汽车', '电子', 'IP', 3, 'CHAN01249'], ['其它', 'IP', 2, 'CHAN01250'], ['化学', '机械', '研磨', '设备', 4, 'CHAN01261'], ['化合物', '外延', '片', 3, 'CHAN01263'], ['SiC', '外延', 2, 'CHAN01264'], ['GaN', '外延', 2, 'CHAN01265'], ['SiC', '晶圆', '加工', 3, 'CHAN01268'], ['GaN', '晶圆', '加工', 3, 'CHAN01269'], ['应用领域', 1, 'CHAN01270'], ['消费', '电子', 2, 'CHAN01271'], ['计算机', '与', '办公设备', 3, 'CHAN01272'], ['网络通信', 1, 'CHAN01273'], ['物', '联网', 2, 'CHAN01274'], ['人工智能', 1, 'CHAN01275'], ['汽车', '电子', 2, 'CHAN01276'], ['工业', '控制', 2, 'CHAN01277'], ['医疗', '电子', 2, 'CHAN01278'], ['智能', '电网', 2, 'CHAN01279'], ['光伏', '发电', 2, 'CHAN01280'], ['轨道交通', 1, 'CHAN01281'], ['手机', '快充', 2, 'CHAN01282'], ['充电', '桩', '/', '充电站', 4, 'CHAN01283'], ['5G', '基站', 2, 'CHAN01284']]

#企业描述
p_1=re.compile(r'（.*）|【.*】|（.*\)|本.*在于|一般.*：|A-Za-z0-9_.!+-=——,$%^，。？、~@#￥%……&*《》<>「」{}【】()/')#制定匹配规则
dict_1={}
data_1=pd.read_excel(r'C:\Users\ThinkPad\Desktop\gba\demo-test.xlsx')
for i in data_1.index.values:#获取行号的索引，并对其遍历
  val=data_1.loc[i,['唯一id','经营范围']]
  dict_1[val[0]]=re.sub(p_1,'',val[1])
#专利描述
dict_2={}
p_2=re.compile(r'（.*）|【.*】|（.*\)|可以.*，|.*在于|A-Za-z0-9_.!+-=——,$%^，。？、~@#￥%……&*《》<>「」{}【】()/')#制定匹配规则
data_2=pd.read_excel(r'C:\Users\ThinkPad\Desktop\gba\企业专利-test.xlsx')
dsum = data_2.groupby('unique_code')['abo'].sum()#由于存在相同键名,要先合并所有专利表述
for i in range(0,len(dsum)):
  dict_2[dsum.index[i]]=re.sub(p_2,'',dsum.values[i])
#合并相关信息
dict_3={key:str(dict_1[key])+str(dict_2[key]) for key in dict_1 if key in dict_2}#列表推导式
dict_1.update(dict_3)

result=[]
for key in dict_1:
  record=[key]
  for label in text:
    n=0
    i=0
    k=len(label)
    while i<=k-2:
      if label[i] in dict_1[key]:
        n+=1
      i+=1
    if n>=k-2:
      record.append(label[k-1])
  result.append(record)
print(result)















# #统一键名
# data_2["unique_id"] =data_2.pop("唯一id")
# data_2["abo"]=data_2.pop("经营范围")
# #对同一公司的所有信息进行整合 字典:'公司id'，‘相关信息(经营范围+专利描述)’
# data_2={key:str(data_2[key])+str(data_1[key]) for key in data_2 if key in data_1}#列表推导式
# print(data_2.item())



# ##准备字典
# data_1 = pd.read_excel(r'C:\Users\ThinkPad\Desktop\gba\半导体产业链v1.xlsx')
# text=[]
# for j in range(2,len(data_1.columns)+1):
#     for i in range(1,len(data_1)+1):
#       val=data_1.values[i,j]
#       if not pd.isna(val):
#         text.append(val+" 1000"+"\n")
# with open(r'C:\Users\ThinkPad\Desktop\gba\wrdic.txt','w') as wrd:
#   wrd.writelines(text)